---
kind: type
id: T:Autodesk.Revit.DB.Events.ViewExportingEventArgs
source: html/46171adf-d115-9796-b6f7-7d1e27d5d3b5.htm
---
# Autodesk.Revit.DB.Events.ViewExportingEventArgs

The event arguments used by the ViewExporting event.

## Syntax (C#)
```csharp
public class ViewExportingEventArgs : RevitAPIPreDocEventArgs
```